{"query": "What is the annual deductible for the Northwind Standard plan?", "context": "A deductible is the amount of money that you will need to pay out of pocket before your insurance plan will begin to cover the costs of your medical services. The deductible for Northwind Standard is $2,000 per person, per year.", "ground_truth": "The deductible for the Northwind Standard plan is $2,000 per person, per year.", "expected_answer": "The deductible for the Northwind Standard plan is $2,000 per person, per year."}
{"query": "Does the Northwind Standard plan cover mental health services?", "context": "This plan does not offer coverage for emergency services, mental health and substance abuse coverage, or out-of-network services.", "ground_truth": "No, the Northwind Standard plan does not cover mental health or substance abuse services.", "expected_answer": "No, the Northwind Standard plan does not cover mental health or substance abuse services."}
{"query": "What is the copayment for a specialist visit?", "context": "For Northwind Standard, the co-payment is $30 for primary care visits and $50 for specialist visits.", "ground_truth": "The copayment for a specialist visit under the Northwind Standard plan is $50.", "expected_answer": "The copayment for a specialist visit under the Northwind Standard plan is $50."}
{"query": "Are preventive care services covered?", "context": "Make sure to take advantage of preventive care services. These services are covered 100% by the plan and can help you avoid more costly treatments down the line.", "ground_truth": "Yes, preventive care services are covered at 100% under the Northwind Standard plan.", "expected_answer": "Yes, preventive care services are covered at 100% under the Northwind Standard plan."}
{"query": "What is the out-of-pocket maximum for an individual?", "context": "The out-of-pocket maximum for Northwind Standard is $6,000 per person, per year. This is the maximum amount that you will need to pay for your medical expenses in a given year.", "ground_truth": "The out-of-pocket maximum for the Northwind Standard plan is $6,000 per person, per year.", "expected_answer": "The out-of-pocket maximum for the Northwind Standard plan is $6,000 per person, per year."}
{"query": "What is the capital of France?", "context": "This dataset contains information about health insurance plans and does not include geographical data.", "ground_truth": "Not applicable.", "expected_answer": "The requested information is not available."}
